[
    {
        "Field":"BOL Number",
        "Description":"A unique number assigned to the Bill of Lading for tracking purposes. Sometimes also referred to as the Shipment ID or Load Number.",
        "Alias":"Shipment ID, Load ID, Waybill Number, B\/L Number, BOL, Load Number, BOL Number"
    },
    {
        "Field":"Carrier Name",
        "Description":"The name of the company or entity responsible for the transportation of the goods.",
        "Alias":"Transporter, Hauler, Transport Company, Carrier, Carrier Name"
    },
    {
        "Field":"Commodity",
        "Description":"The goods or products being shipped. Only extract the first commodity listed.",
        "Alias":"Product Description, Description, Goods, Cargo, Item, Freight Description, Cargo, Commodity"
    },
    {
        "Field":"Delivery Date",
        "Description":"The date when the shipment is expected to arrive at the destination. May also be referred to as Expected Delivery Date or ETA (Estimated Time of Arrival). Please keep the format as MM/DD/YYYY and do not include time.",
        "Alias":"ETA, Estimated Delivery Date, Delivery ETA, Consignee Signature Date,  Delivery Date"
    },
    {
        "Field":"Destination Address",
        "Description":"The address where the goods are to be delivered. Also referred to as the Consignee Address. Do not need to include the recipient name.",
        "Alias":"Consignee Address, Deliver Address, Ship To, Receiving Address, Destination Address"
    },
    {
        "Field":"Destination Name",
        "Description":"The name of the business or person receiving the goods. This can be referred to as the Consignee.",
        "Alias":"Consignee, Dest Name, Destination Name"
    },
    {
        "Field":"Freight Class",
        "Description":"A classification that determines the cost of shipping, typically based on density, stowability, handling, and liability. This term is specific to LTL (Less-Than-Truckload) shipments. Freight class is commonly three or four digits and can be more than on one a Bill of Lading. ONLY if there are multiple distinct freight classes, place them in a list [], otherwise just return the value.",
        "Alias":"FC, Shipping Class, Class, Freight Class"
    },
    {
        "Field":"Origin Address",
        "Description":"The address from where the shipment originates. Also known as Shipper’s Address or Place of Origin. Do not include the shipper's name.",
        "Alias":"Ship From, Shipper Address, Pickup Address, Shipping Address, Origin"
    },
    {
        "Field":"Origin Name",
        "Description":"The name of the company or person sending the goods. Often referred to as Shipper or Consignor.",
        "Alias":"Shipper Name, Consignor, Ship From Name, Sender"
    },
    {
        "Field":"PO Number",
        "Description":"A number referencing the purchase order associated with the shipment. Sometimes simply called Purchase Order or PO Reference. ONLY if there are multiple PO number, place them in a list [], otherwise just return value.",
        "Alias":"Purchase Order Reference, PO, PO Ref, Order Number, (Customer Order Number is commonly used if the field does not exist)"
    },
    {
        "Field":"Pro Number",
        "Description":"A number assigned by the carrier to track the shipment through their system. It can be called the Tracking Number or Carrier Tracking Number. ONLY if multiple Pro Number found, place them in a list [], otherwise just return value.",
        "Alias":"Carrier Tracking Number, Tracking Number, Pro Number"
    },
    {
        "Field":"Quantity",
        "Description":"The total number of units of the commodity being shipped. This refers to the total quantity for the complete shipment not the individual line item quantity found on the Bill of Lading.",
        "Alias":"Total Pallets, Total Units, Total"
    },
    {
        "Field":"Quantity UOM",
        "Description":"The unit used to quantify the shipment, such as 'pieces,' 'pallets,' or 'cases.' ",
        "Alias":"Pallets, Cases, Pieces, Boxes, Bales"
    },
    {
        "Field":"Reference Number",
        "Description":"A unique number used to link the shipment to a specific internal or external transaction. This can be known as Shipment Reference or Internal Reference. Only use the aliases provided, nothing else.",
        "Alias":"Customer Reference, Shipment Reference"
    },
    {
        "Field":"Signature Count",
        "Description":"The number of distinct signatures on the document.",
        "Alias":"Signatures"
    },
    {
        "Field":"SCAC",
        "Description":"A unique code assigned to each transportation company, used to identify them across different systems and documents.",
        "Alias":"Usually none, but might be referred to as Carrier Code, SCAC"
    },
    {
        "Field":"Seal",
        "Description":"A security feature placed on the trailer door to ensure that the contents of the shipment are not tampered with during transit. Also referred to as a Trailer Seal or Security Seal. ONLY if multiple seal is found, place them in a list [], otherwise return the value.",
        "Alias":"Trailer Seal, Security Seal, Seal Identifier"
    },
    {
        "Field":"Ship Date",
        "Description":"The date when the goods leave the origin. It is sometimes called the Pickup Date or Dispatch Date.  You may commonly find this as just the Date on the BOL, likely found towards to the top of the BOL without any real designation of a label or a simple label of Date. Please keep the format as MM/DD/YYYY and do not include time.",
        "Alias":"Pickup Date, Order Date, Dispatch Date, Load Date"
    },
    {
        "Field":"Shipment Number",
        "Description":"A number used to identify a specific shipment, typically assigned by the shipper. Only use the aliases provided, nothing else.",
        "Alias":"Ship Number, Load Number"
    },
    {
        "Field":"Temperature",
        "Description":"The required temperature for the shipment, especially important for perishable goods. Sometimes referred to as Temperature Control or Temp Set. Include F or C at the end for units.",
        "Alias":"Temp, Temp Set, Temp Control"
    },
    {
        "Field":"Trailer",
        "Description":"The identification number or type of the trailer being used to transport the shipment. It might also be referred to as the Trailer ID or Equipment Number. Only use the aliases provided, nothing else.",
        "Alias":"Trailer ID"
    },
    {
        "Field":"Weight",
        "Description":"The total net weight of the shipment. Do not include units of measurement.",
        "Alias":"Total Net Weight, if Net Weight is not found, any Total Weight"
    },
    {
        "Field":"Weight UOM",
        "Description":"The unit used to measure the weight of the shipment, such as pounds (lbs) or kilograms (kg). Sometimes just abbreviated as UOM.",
        "Alias":"Commonly seen as LB, (LB), KG, (KG) and could see both.  We are interested in the Net Weight if available, not the Gross Weight, but if Net Weight UOM is not explicitly available then use any total weight found.  We are looking for Total Weight not the weight of each line item.  Also, if Both LB and KG are found we prefer LB over KG."
    }
]